app/models/concerns/access_trackable.rb

  def track_access!(resource:, action: "view")
    AccessLog.create!(
      user: Current.user,
      resource_type: resource.class.name,
      resource_id: resource.id,
      action: action,
      ip_address: request.remote_ip,
      user_agent: request.user_agent.to_s.first(255)
    )
---
INSERT INTO "access_logs" ("user_id", "resource_type", "resource_id", "action", "ip_address", "user_agent", "created_at", "updated_at") VALUES (1, 'Patient', 25, 'view_patient', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/147.0.0.0 Safari/537.36', '2026-05-06 07:49:27.529600', '2026-05-06 07:49:27.529600') RETURNING "id"