app/models/concerns/auditable.rb

  def audit!(action, changeset)
    return if changeset.blank?

    AuditLog.create!(
      user: Current.user,
      action: action,
      auditable_type: self.class.name,
      auditable_id: id,
      changeset: changeset
    )
---
INSERT INTO "audit_logs" ("user_id", "action", "auditable_type", "auditable_id", "changeset", "created_at", "updated_at", "event_hash", "previous_hash") VALUES (NULL, 'update', 'User', 1, '{"password_digest":["$2a$12$iCqntAZEsRReUD9b.IbVsurJgSXEVGr.Zjid86FeXxbPY72taORpW","$2a$12$XjHpCzoyOoV9vNhr.14KBuk0TrUgsGJ90hp5rWa7UcmiGXVpVpFk."]}', '2026-05-05 14:27:10.534869', '2026-05-05 14:27:10.534869', '50acab287f121fb73e35fdeb538bc1d324660798185dcb2fa49eb396c6bd4216', '') RETURNING "id"