app/views/invoices/_form.html.erb

SELECT "patients".* FROM "patients" ORDER BY "patients"."first_name" ASC
---
      <%= form.label :patient_id, class: "input-label" %>
      <%= form.collection_select :patient_id, Patient.order(:first_name), :id, :full_name, { prompt: "Select patient" }, class: "input-field" %>

SELECT "treatment_records".* FROM "treatment_records" ORDER BY "treatment_records"."performed_on" DESC
---
      <%= form.label :treatment_record_id, class: "input-label" %>
      <%= form.collection_select :treatment_record_id, TreatmentRecord.order(performed_on: :desc), :id, :id, { prompt: "Select treatment record" }, class: "input-field" %>