app/views/document_templates/index.html.erb

  </section>
  <section class="table-shell"><table class="data-table"><thead><tr><th>Name</th><th>Kind</th><th>Status</th><th class="text-right">Actions</th></tr></thead><tbody><% @document_templates.each do |template| %><tr><td class="font-semibold text-stone-800"><%= template.name %></td><td><%= template.kind.humanize %></td><td><%= template.active? ? "Active" : "Inactive" %></td><td class="text-right"><% if can_access_feature?(:document_templates, :view) %><%= link_to "View", document_template_path(template), class: "btn btn-secondary px-3 py-1.5 text-xs" %><% end %></td></tr><% end %></tbody></table></section>
---
SELECT "document_templates".* FROM "document_templates" ORDER BY "document_templates"."kind" ASC, "document_templates"."name" ASC