app/views/notifications/_form.html.erb

SELECT "patients".* FROM "patients" ORDER BY "patients"."first_name" ASC
---
      <%= form.label :patient_id, class: "input-label" %>
      <%= form.collection_select :patient_id, Patient.order(:first_name), :id, :full_name, { prompt: "Select patient" }, class: "input-field" %>