app/views/patients/show.html.erb

SELECT "patient_consents".* FROM "patient_consents" WHERE "patient_consents"."patient_id" = 25 ORDER BY "patient_consents"."consented_at" DESC LIMIT 20
---
        <tbody>
          <% @patient.patient_consents.order(consented_at: :desc).limit(20).each do |consent| %>