app/controllers/api/v1/patients_controller.rb

SELECT "patients".* FROM "patients" ORDER BY "patients"."last_name" ASC, "patients"."first_name" ASC
---
      def index
        patients = Patient.order(:last_name, :first_name)