app/views/treatment_records/_form.html.erb

SELECT "patients".* FROM "patients" ORDER BY "patients"."first_name" ASC
---
      <%= form.label :patient_id, class: "input-label" %>
      <%= form.collection_select :patient_id, Patient.order(:first_name), :id, :full_name, { prompt: "Select patient" }, class: "input-field" %>

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
      <%= form.label :user_id, class: "input-label" %>
      <%= form.collection_select :user_id, User.order(:name), :id, :name, { prompt: "Select provider" }, class: "input-field" %>

SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."starts_at" DESC
---
      <%= form.label :appointment_id, class: "input-label" %>
      <%= form.collection_select :appointment_id, Appointment.order(starts_at: :desc), :id, :id, { prompt: "Select appointment" }, class: "input-field" %>