app/views/payments/_form.html.erb

SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."updated_at" DESC
---
      <%= form.label :invoice_id, class: "input-label" %>
      <%= form.collection_select :invoice_id, Invoice.order(updated_at: :desc), :id, :id, { prompt: "Select invoice" }, class: "input-field" %>