app/controllers/appointments_controller.rb

  def index
    @selected_date = parse_selected_date(params[:date])
    load_weekly_dashboard(@selected_date || Time.zone.today)
    @selected_day_appointments = if @selected_date.present?
      Appointment.includes(:patient, :user).where(starts_at: @selected_date.all_day).order(:starts_at)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."starts_at" BETWEEN '2026-05-31 00:00:00' AND '2026-07-04 23:59:59.999999' ORDER BY "appointments"."starts_at" ASC
SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (8, 6, 22, 20, 12, 7, 14, 17, 13, 23, 25, 16, 11)
SELECT "users".* FROM "users" WHERE "users"."id" IN (8, 7)

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("patient_id", "user_id", "source", "booking_type", "starts_at", "ends_at", "status", "notes", "created_at", "updated_at", "operatory") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @appointment.destroy!
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 980190962]]

    def set_appointment
      @appointment = Appointment.find(params.expect(:id))
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

    def load_weekly_dashboard(base_day)
      @appointments = Appointment.includes(:patient, :user, :clinic_service, treatment_records: :invoice).order(:starts_at)
---
SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."starts_at" ASC