app/controllers/audit_logs_controller.rb

SELECT "audit_logs".* FROM "audit_logs" ORDER BY "audit_logs"."created_at" DESC LIMIT 500
---
  def index
    @audit_logs = AuditLog.includes(:user).order(created_at: :desc).limit(500)