app/controllers/clinic_services_controller.rb

  def index
    @clinic_services = ClinicService.order(:name)
---
SELECT "clinic_services".* FROM "clinic_services" ORDER BY "clinic_services"."name" ASC

  def set_clinic_service
    @clinic_service = ClinicService.find(params.expect(:id))
---
SELECT "clinic_services".* FROM "clinic_services" WHERE "clinic_services"."id" = 4 LIMIT 1