app/controllers/compliance_controller.rb

  def show
    @total_patients = Patient.count
    @consented_patients = Patient.joins(:patient_consents).distinct.count
    @consent_coverage = if @total_patients.zero?
      100
    else
      ((@consented_patients.to_f / @total_patients) * 100).round(1)
    end

    @recent_access_logs = AccessLog.includes(:user).order(created_at: :desc).limit(50)
    @recent_audit_logs = AuditLog.includes(:user).order(created_at: :desc).limit(50)
---
SELECT COUNT(*) FROM "patients"
SELECT COUNT(DISTINCT "patients"."id") FROM "patients" INNER JOIN "patient_consents" ON "patient_consents"."patient_id" = "patients"."id"
SELECT "access_logs".* FROM "access_logs" ORDER BY "access_logs"."created_at" DESC LIMIT 50
SELECT "audit_logs".* FROM "audit_logs" ORDER BY "audit_logs"."created_at" DESC LIMIT 50