app/controllers/dental_chart_entries_controller.rb

  def create
    entry = @patient.dental_chart_entries.new(dental_chart_entry_params.except(:annotated_image_data))
    entry.user = current_user
    attach_annotated_image(entry)

    if entry.save
---
INSERT INTO "dental_chart_entries" ("patient_id", "user_id", "tooth_code", "entry_type", "notes", "recorded_on", "created_at", "updated_at", "surface_marks") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_patient
    @patient = Patient.find(params.expect(:patient_id))
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]