app/controllers/document_templates_controller.rb

  def index
    @document_templates = DocumentTemplate.kept.order(:kind, :name)
---
SELECT "document_templates".* FROM "document_templates" ORDER BY "document_templates"."kind" ASC, "document_templates"."name" ASC