app/controllers/home_controller.rb

  def index
    today = Time.zone.today
    selected_month = parse_month_param(params[:month]) || today
    month_start = selected_month.beginning_of_month
    month_end = selected_month.end_of_month
    calendar_start = month_start.beginning_of_week(:sunday)
    calendar_end = month_end.end_of_week(:sunday)

    @stats = {
      patients: Patient.count,
      appointments_today: Appointment.where(starts_at: today.all_day).count,
      treatments_this_month: TreatmentRecord.where(performed_on: month_start..month_end).count,
      outstanding_balance: Invoice.sum(:balance_amount)
    }

    @upcoming_appointments = Appointment.includes(:patient, :user).where(starts_at: Time.current..).order(:starts_at).limit(8)
    @recent_invoices = Invoice.includes(:patient).order(updated_at: :desc).limit(8)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."starts_at" BETWEEN '2026-04-26 00:00:00' AND '2026-06-06 23:59:59.999999' ORDER BY "appointments"."starts_at" ASC
SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (8, 6, 22, 20, 12, 7, 14, 17, 13, 23, 25, 16, 11, 19, 9, 18, 24, 15, 10, 21)
SELECT "users".* FROM "users" WHERE "users"."id" IN (8, 7)
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."updated_at" DESC LIMIT 8