app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."updated_at" DESC
SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6)
SELECT "treatment_records".* FROM "treatment_records" WHERE "treatment_records"."id" IN (142, 141, 140, 139, 138, 137, 136, 135, 134, 133, 132, 131, 130, 129, 128, 127, 126, 125, 124, 123, 122, 121, 120, 119, 118, 117, 116, 115, 114, 113, 112, 111, 110, 109, 108, 107, 106, 105, 104, 103, 102, 101, 100, 99, 98, 97, 96, 95, 94, 93, 92, 91, 90, 89, 88, 87, 86, 85, 84, 83, 82, 81, 80, 79, 78, 77, 76, 75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51, 50, 49, 48, 47, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."paid_on" BETWEEN '2026-05-01' AND '2026-05-31'
SELECT "invoices".* FROM "invoices"
SELECT SUM("invoices"."balance_amount") FROM "invoices"
---
  def index
    @invoices = Invoice.includes(:patient, :treatment_record).order(updated_at: :desc)
    @monthly_revenue = Payment.where(paid_on: Time.zone.today.beginning_of_month..Time.zone.today.end_of_month).sum(:amount)
    @outstanding_balance = Invoice.sum(:balance_amount)

INSERT INTO "invoices" ("patient_id", "treatment_record_id", "status", "total_amount", "balance_amount", "issued_on", "approved_by_dentist_at", "approved_by_admin_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 980190962]]
---
  def destroy
    @invoice.destroy!

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_invoice
      @invoice = Invoice.find(params.expect(:id))