app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
  def index
    @notifications = Notification.all

INSERT INTO "notifications" ("patient_id", "channel", "category", "scheduled_for", "sent_at", "status", "message", "created_at", "updated_at", "source_record_type", "source_record_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @notification = Notification.new(notification_params)

    respond_to do |format|
      if @notification.save

DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 980190962]]
---
  def destroy
    @notification.destroy!

SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_notification
      @notification = Notification.find(params.expect(:id))