app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.includes(:patient).order(scheduled_for: :desc)
---
SELECT "notifications".* FROM "notifications" ORDER BY "notifications"."scheduled_for" DESC