app/controllers/patients_controller.rb

  def index
    @search_query = params[:search].to_s.strip
    @patients = Patient.order(updated_at: :desc)
    if @search_query.present?
      q = Patient.sanitize_sql_like(@search_query.downcase)
      contains_term = "%#{q}%"
      starts_term = "#{q}%"

      email_user_sql = "LOWER(CASE WHEN INSTR(COALESCE(email, ''), '@') > 0 THEN SUBSTR(COALESCE(email, ''), 1, INSTR(COALESCE(email, ''), '@') - 1) ELSE COALESCE(email, '') END)"
      full_name_sql = "LOWER(COALESCE(first_name, '') || ' ' || COALESCE(last_name, ''))"
      email_match_sql = @search_query.include?("@") ? "LOWER(COALESCE(email, ''))" : email_user_sql
---
SELECT "patients".* FROM "patients"
SELECT 1 AS one FROM "patients" LIMIT ?  [["LIMIT", 1]]