app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" ORDER BY "patients"."updated_at" DESC
SELECT COUNT(DISTINCT "treatment_records"."patient_id") FROM "treatment_records" WHERE "treatment_records"."performed_on" BETWEEN '2026-04-05' AND '2026-05-05'
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."status" = 'confirmed' AND (starts_at <= '2026-05-06 14:35:28.814288')
---
  def index
    @patients = Patient.order(updated_at: :desc)
    @active_treatment_count = TreatmentRecord.where(performed_on: 30.days.ago.to_date..Date.current).select(:patient_id).distinct.count
    @urgent_cases_count = Appointment.where(status: "confirmed").where("starts_at <= ?", 24.hours.from_now).count

INSERT INTO "patients" ("first_name", "last_name", "birth_date", "phone", "email", "emergency_contact_name", "emergency_contact_phone", "medical_history", "consented_at", "created_at", "updated_at", "user_id", "dental_chart", "chief_complaint", "known_allergies", "current_medications", "medical_conditions", "last_dental_visit_on", "address_line1", "address_line2", "city", "state", "postal_code", "preferred_contact_method", "insurance_provider", "insurance_policy_number") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 980190962]]
---
  def destroy
    @patient.destroy!

SELECT "patients".* FROM "patients" WHERE "patients"."id" = 25 LIMIT 1
---
    def set_patient
      @patient = Patient.find(params.expect(:id))

SELECT COUNT(*) FROM "appointments" WHERE "appointments"."starts_at" BETWEEN '2026-04-05 14:35:28.816098' AND '2026-05-05 14:35:28.816159'
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."starts_at" BETWEEN '2026-04-06 07:44:26.743336' AND '2026-05-06 07:44:26.743376'
---
    def appointment_attendance_rate
      total = Appointment.where(starts_at: 30.days.ago..Time.current).count
      return 100 if total.zero?

      completed = Appointment.where(starts_at: 30.days.ago..Time.current, status: "completed").count