app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments"
---
  def index
    @payments = Payment.all