app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments" ORDER BY "payments"."paid_on" DESC
---
  def index
    @payments = Payment.includes(invoice: :patient).order(paid_on: :desc)

INSERT INTO "payments" ("invoice_id", "amount", "paid_on", "method", "reference_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @payment = Payment.new(payment_params)

    respond_to do |format|
      if @payment.save

DELETE FROM "payments" WHERE "payments"."id" = ?  [["id", 980190962]]
---
  def destroy
    @payment.destroy!

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_payment
      @payment = Payment.find(params.expect(:id))