app/controllers/reports_controller.rb

SELECT "dental_chart_entries".* FROM "dental_chart_entries" ORDER BY "dental_chart_entries"."recorded_on" DESC, "dental_chart_entries"."created_at" DESC LIMIT ?  [["LIMIT", 1000]]
---
  def dental_chart_surfaces
    @status_filter = params[:status].to_s.strip
    @tooth_filter = params[:tooth].to_s.strip
    @surface_filter = params[:surface].to_s.strip.upcase

    entries = DentalChartEntry.includes(:patient, :user).order(recorded_on: :desc, created_at: :desc).limit(1000)