app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'owner@dentivara.local' LIMIT 1