app/controllers/treatment_records_controller.rb

  def index
    @treatment_records = TreatmentRecord.all
---
SELECT "treatment_records".* FROM "treatment_records"