app/controllers/treatment_records_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" IN (?, ?)  [["id", 298486374], ["id", 980190962]]
SELECT "treatment_records".* FROM "treatment_records" ORDER BY "treatment_records"."performed_on" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 298486374], ["id", 980190962]]
---
  def index
    @treatment_records = TreatmentRecord.includes(:patient, :user, :appointment).order(performed_on: :desc)

INSERT INTO "treatment_records" ("patient_id", "user_id", "appointment_id", "service_type", "clinical_notes", "cost", "performed_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @treatment_record = TreatmentRecord.new(treatment_record_params)

    respond_to do |format|
      if @treatment_record.save

DELETE FROM "treatment_records" WHERE "treatment_records"."id" = ?  [["id", 980190962]]
---
  def destroy
    @treatment_record.destroy!

SELECT "treatment_records".* FROM "treatment_records" WHERE "treatment_records"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_treatment_record
      @treatment_record = TreatmentRecord.find(params.expect(:id))