app/controllers/users_controller.rb

  def index
    @users = User.order(updated_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."updated_at" DESC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Dr. Reyes"], ["email", "[FILTERED]"], ["role", 1], ["created_at", "2026-05-07 11:16:20.279276"], ["updated_at", "2026-05-07 11:16:20.279276"], ["password_digest", "[FILTERED]"]]

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1