app/models/appointment.rb

SELECT 1 AS one FROM "appointments" WHERE "appointments"."user_id" = 8 AND "appointments"."id" IS NOT NULL AND (starts_at < '2026-05-14 10:00:00' AND ends_at > '2026-05-14 09:00:00') LIMIT 1
---
  def provider_availability
    return if starts_at.blank? || ends_at.blank? || user_id.blank?

    overlapping = self.class.where(user_id: user_id)
                            .where.not(id: id)
                            .where("starts_at < ? AND ends_at > ?", ends_at, starts_at)
                            .exists?

INSERT INTO "notifications" ("patient_id", "channel", "category", "scheduled_for", "sent_at", "status", "message", "created_at", "updated_at", "source_record_type", "source_record_id") VALUES (6, 'email', 'appointment', '2026-05-15 14:00:00', NULL, 'pending', 'Reminder: You have an appointment on May 16, 2026 at 02:00 PM.', '2026-05-05 14:12:31.973947', '2026-05-05 14:12:31.973947', 'Appointment', 63) RETURNING "id"
---
  def queue_appointment_reminder
    return if patient.email.blank?

    Notification.create!(
      patient: patient,
      channel: "email",
      category: "appointment",
      scheduled_for: [starts_at - 24.hours, Time.current].max,
      status: "pending",
      message: "Reminder: You have an appointment on #{starts_at.strftime('%B %d, %Y at %I:%M %p')}.",
      source_record: self
    )