app/models/audit_log.rb

  def assign_chain_hashes
    self.previous_hash ||= self.class.order(:id).last&.event_hash.to_s
---
SELECT "audit_logs".* FROM "audit_logs" ORDER BY "audit_logs"."id" DESC LIMIT 1