app/models/invoice.rb

INSERT INTO "notifications" ("patient_id", "channel", "category", "scheduled_for", "sent_at", "status", "message", "created_at", "updated_at", "source_record_type", "source_record_id") VALUES (7, 'email', 'billing', '2026-05-05 14:12:32.294370', NULL, 'pending', 'Invoice #65 has an outstanding balance of 2053.0.', '2026-05-05 14:12:32.294614', '2026-05-05 14:12:32.294614', 'Invoice', 65) RETURNING "id"
---
  def queue_billing_notification
    return unless balance_amount.to_d.positive?
    return if patient.email.blank?
    return unless saved_change_to_balance_amount? || previously_new_record?
    return if Notification.where(source_record: self, category: "billing").where("created_at >= ?", 12.hours.ago).exists?

    Notification.create!(
      patient: patient,
      channel: "email",
      category: "billing",
      scheduled_for: Time.current,
      status: "pending",
      message: "Invoice ##{id} has an outstanding balance of #{balance_amount}.",
      source_record: self
    )