app/models/payment.rb

  def refresh_invoice_balance
    return unless Invoice.exists?(invoice_id)

    invoice.reload
    paid_total = invoice.payments.sum(:amount)
    new_balance = [invoice.total_amount.to_d - paid_total, 0.to_d].max
    next_status = if new_balance.zero?
      "paid"
    elsif paid_total.positive?
      "partially_paid"
    else
      invoice.status
    end
    invoice.update_columns(balance_amount: new_balance, status: next_status, updated_at: Time.current)
---
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."invoice_id" = 2
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."invoice_id" = 63
UPDATE "invoices" SET "balance_amount" = 0.0, "status" = 'paid', "updated_at" = '2026-05-05 14:06:45.594343' WHERE "invoices"."id" = 2