app/views/appointments/_form.html.erb

SELECT "patients".* FROM "patients" ORDER BY "patients"."first_name" ASC
---
      <%= form.label :patient_id, class: "input-label" %>
      <%= form.collection_select :patient_id, Patient.order(:first_name), :id, :full_name, { prompt: "Select patient" }, class: "input-field" %>

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
      <%= form.label :user_id, class: "input-label" %>
      <%= form.collection_select :user_id, User.order(:name), :id, :name, { prompt: "Select provider" }, class: "input-field" %>