app/views/appointments/index.html.erb

SELECT "appointments".* FROM "appointments"
---
        <div class="space-y-2">
          <% Appointment::STATUSES.each do |status| %>