app/jobs/notification_dispatch_job.rb

  def perform(notification_id)
    notification = Notification.find_by(id: notification_id)
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = 3 LIMIT 1